In [9]:
import pandas as pd
import numpy as np
import openpyxl

In [10]:
df = pd.read_excel('Email Marketing Analysis.xlsx')

In [11]:
df.head()

,Column1,Type,Status,City,State,PostalCode,GenderCode,BirthDate,MaritalStatus,Enrolled on,Living status
0,00005DCC-4E51-41A5-91C5-6635B24C7D17,Business,InActive,NaN,NaN,500024.0,MALE,2018-08-12 17:07:12.430,U,2018-08-12 17:07:12.430,couple with children
1,0001F49E-9FE7-11e8-9E9C-00505682069A,Individual,Active,Valsad,GUJARAT,396001.0,MALE,1992-11-02 00:00:00.000,M,2018-08-14 18:02:46.000,couple with children
2,0001F4A2-9FE7-11e8-9E9C-00505682069A,Individual,Active,Secunderabad,TELANGANA,500011.0,FEMALE,1988-11-25 00:00:00.000,M,2018-08-14 18:05:23.000,couple with children
3,0001F4CD-9FE7-11e8-9E9C-00505682069A,Individual,Active,Nalgonda,TELANGANA,508101.0,MALE,1983-06-13 00:00:00.000,M,2018-08-14 18:37:33.000,couple with children
4,0001F4DE-9FE7-11e8-9E9C-00505682069A,Individual,Active,Hyderabad,TELANGANA,500028.0,MALE,1975-07-13 00:00:00.000,M,2018-08-14 18:47:00.000,couple with children

In [12]:
df['Type'].value_counts()

Individual    9736
Business       264
Name: Type, dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Column1        10000 non-null  object
 1   Type           10000 non-null  object
 2   Status         10000 non-null  object
 3   City           9927 non-null   object
 4   State          9874 non-null   object
 5   PostalCode     9999 non-null   float64
 6   GenderCode     10000 non-null  object
 7   BirthDate      10000 non-null  datetime64[ns]
 8   MaritalStatus  10000 non-null  object
 9   Enrolled on    10000 non-null  datetime64[ns]
 10  Living status  10000 non-null  object
dtypes: datetime64[ns](2), float64(1), object(8)
memory usage: 859.5+ KB

In [15]:
df.drop(['Column1','PostalCode','BirthDate'],axis=1,inplace=True)

In [17]:
df.head()

,Type,Status,City,State,GenderCode,MaritalStatus,Enrolled on,Living status
0,Business,InActive,NaN,NaN,MALE,U,2018-08-12 17:07:12.430,couple with children
1,Individual,Active,Valsad,GUJARAT,MALE,M,2018-08-14 18:02:46.000,couple with children
2,Individual,Active,Secunderabad,TELANGANA,FEMALE,M,2018-08-14 18:05:23.000,couple with children
3,Individual,Active,Nalgonda,TELANGANA,MALE,M,2018-08-14 18:37:33.000,couple with children
4,Individual,Active,Hyderabad,TELANGANA,MALE,M,2018-08-14 18:47:00.000,couple with children